from põrand import *
from vastased import *

screenid = {
    -1:[Põrand(750+400,800+400,250)],
    0:[Põrand(100,200,400),Põrand(700,850,400),Põrand(750+400,800+400,250)],
    1:[Põrand(10+400,800+400,250),Põrand(100,400,400),Põrand(700,720,600)]
    }

vastased_ekraanis = {
    -1:[Vampiir(200, 500, 75, 50, 5, 8, 3, (200,0,0), 300, 0.1)],
    0:[Jälitaja(400, 500, 40, 40, 5, 10, 1,(0,0,200)), Zombie(860, 500, 60, 40, 3, 10, 5, (0,150,0), 280)],
    1:[Jälitaja(900, 250, 40, 40, 6, 20, 1,(0,0,200))]
    }
